#include<stdio.h>
#include<conio.h>
#include<stdlib.h>
//两张地图，具体符号代表什么，不多解释
//第一关人物图案为O，第二关为S
//下标1为关卡标号，下标2为坐标x，下标3为y
char maps[2][10][10]={
    {
        {'#','#','#','#','#','#',' '},
        {'#',' ',' ','#',' ',' ',' '},
        {'#',' ','#','#',' ','#',' '},
        {'#',' ',' ','#',' ','#',' '},
        {'#','#',' ',' ',' ','#',' '},
        {'#','#','#','#','#','#',' '}
    },
    {
        {'#','#','#','#','#','#','#','#','#','#'},
        {'#','#',' ',' ',' ',' ',' ','#','#','#'},
        {'#','#','O','#','#','#',' ',' ',' ','#'},
        {'#',' ',' ',' ','O',' ',' ','O',' ','#'},
        {'#',' ',' ',' ','#',' ','O',' ','#','#'},
        {'#','#',' ',' ','#',' ',' ',' ','#','#'},
        {'#','#','#','#','#','#','#','#','#','#'}
    }
};
//*所在位置
int x1=4,x2=4,x3=5,x4=5;
int y1=2,y2=3,y3=2,y4=3;
int cnt;   /*用来记录当前为第几关*/
int main(){
    int num=0;  //已经放好的箱子数
    int max_x=6,max_y=6;    //地图长宽，初始为第一关,这里的x指纵向，y指横向
    int x=1,y=1;  //人物坐标，初始为第一关的
    while(1){
        //清屏
        system("cls");
        //判断是否通过第一关
        if(cnt==0&&x==1&&y==6){
            cnt++;  //进入下一关
            x=3,y=2;    //将人物坐标变为第二关的初始坐标
            max_x=7,max_y=10;   //改为第二关地图大小
        }
        //判断是否通过第二关
        if(cnt==1&&num==4){
            cnt++;  //进入下一关
        }
        //判断是否通关
        if(cnt==2){
            printf("You win!");
            break;
        }
        //画图
        for(int i=0;i<max_x;++i){
            for(int j=0;j<max_y;++j){
                if(i==x&&j==y){ //判断是否是人物位置
                    if(cnt==0) printf("O");
                    if(cnt==1) printf("S");
                }//判断是否是*位置，且是否为第二关，且是否此位置被其他东西占据 
                else if(((i==x1&&j==y1)||(i==x2&&j==y2)||(i==x3&&j==y3)||(i==x4&&j==y4))&&maps[cnt][i][j]!='O'&&cnt==1){
                    printf("*");
                }
                else printf("%c",maps[cnt][i][j]);
            }
            printf("\n");
        }
        //等待键入方向
        int ch;
        ch=getch();
        switch(ch)
            {
            	//上下左右都一样，所以只注释向上的 
                /*上*/case 72:
                //判断是否可走 
                if(maps[cnt][x-1][y]==' '||maps[cnt][x-1][y]=='*') x--;
                else if(maps[cnt][x-1][y]=='O'){
					//有箱子要判断箱子是否能推动 
					//靠在墙上推不动 
                    if(maps[cnt][x-2][y]!='#'){
                    	
                        maps[cnt][x-1][y]=' ';
                        maps[cnt][x-2][y]='O';
                        //判断箱子是否推入或推出目标位置 
                        if((x-2==x1&&y==y1)||(x-2==x2&&y==y2)||(x-2==x3&&y==y3)||(x-2==x4&&y==y4)){
                            num++;
                        }
                        if((x-1==x1&&y==y1)||(x-1==x2&&y==y2)||(x-1==x3&&y==y3)||(x-1==x4&&y==y4)){
                            num--;
                        }
                        //箱子动，人也动 
                        x--;
                    }
                }
                break; 
                /*下*/case 80: 
                if(maps[cnt][x+1][y]==' '||maps[cnt][x+1][y]=='*') x++;
                else if(maps[cnt][x+1][y]=='O'){
                    if(maps[cnt][x+2][y]!='#'){
                    	
                        maps[cnt][x+1][y]=' ';
                        maps[cnt][x+2][y]='O';
                        if((x+2==x1&&y==y1)||(x+2==x2&&y==y2)||(x+2==x3&&y==y3)||(x+2==x4&&y==y4)){
                            num++;
                        }
                        if((x+1==x1&&y==y1)||(x+1==x2&&y==y2)||(x+1==x3&&y==y3)||(x+1==x4&&y==y4)){
                            num--;
                        }
                        x++;
                    }
                }
                break; 
                /*左*/case 75: 
                if(maps[cnt][x][y-1]==' '||maps[cnt][x][y-1]=='*') y--;
                else if(maps[cnt][x][y-1]=='O'){
                    if(maps[cnt][x][y-2]!='#'){
                    	
                        maps[cnt][x][y-1]=' ';
                        maps[cnt][x][y-2]='O';
                        if((x==x1&&y-2==y1)||(x==x2&&y-2==y2)||(x==x3&&y-2==y3)||(x==x4&&y-2==y4)){
                            num++;
                        }
                        if((x==x1&&y-1==y1)||(x==x2&&y-1==y2)||(x==x3&&y-1==y3)||(x==x4&&y-1==y4)){
                            num--;
                        }
                        y--;
                    }
                }
                break; 
                /*右*/case 77: 
                if(maps[cnt][x][y+1]==' '||maps[cnt][x][y+1]=='*') y++;
                else if(maps[cnt][x][y+1]=='O'){
                    if(maps[cnt][x][y+2]!='#'){
                        maps[cnt][x][y+1]=' ';
                        maps[cnt][x][y+2]='O';
                        if((x==x1&&y+2==y1)||(x==x2&&y+2==y2)||(x==x3&&y+2==y3)||(x==x4&&y+2==y4)){
                            num++;
                        }
                        if((x==x1&&y+1==y1)||(x==x2&&y+1==y2)||(x==x3&&y+1==y3)||(x==x4&&y+1==y4)){
                            num--;
                        }
                        y++;
                    }
                }
                break; 
                default:break;
            }


    }

    return 0;
}
